Конфигурация/Проверка/DataProcessors/ТестовоеЗаполнениеЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ТестовоеЗаполнениеЦен</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация/Проверка/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУКТЗЕД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетАкцизнуюМарку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Штрихкоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Проверка/DataProcessors/ТестовоеЗаполнениеЦен/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МинимальнаяЦена = 10;
	МаксимальнаяЦена = 1000;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипыЦен.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТипыЦен КАК ТипыЦен
	|ГДЕ
	|	НЕ ТипыЦен.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТипыЦен.Код";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ТипЦен = Выборка.Ссылка;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьПереоценкуКоманда(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Объект.ТипЦен) Тогда
	//	Ждать ПредупреждениеАсинх("Необходимо выбрать тип цен");
	//	Возврат;
	//КонецЕсли;
	//
	Если Объект.МинимальнаяЦена <= 0 Или Объект.МаксимальнаяЦена <= 0 Тогда
		Ждать ПредупреждениеАсинх("Цены должны быть больше нуля");
		Возврат;
	КонецЕсли;
	
	Если Объект.МинимальнаяЦена > Объект.МаксимальнаяЦена Тогда
		Ждать ПредупреждениеАсинх("Минимальная цена не может быть больше максимальной");
		Возврат;
	КонецЕсли;
	
	Ссылка = Ждать СоздатьДокументПереоценкиНаСервере(0, Объект.МинимальнаяЦена, Объект.МаксимальнаяЦена);
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Ждать ОткрытьЗначениеАсинх(Ссылка);
		Ждать ПредупреждениеАсинх("Документ переоценки создан и проведен");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументПереоценкиНаСервере(ТипЦен, МинимальнаяЦена, МаксимальнаяЦена)
	
	// Запрос для получения всех номенклатур
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Создаем документ Переоценка
	ДокументПереоценка = Документы.Переоценка.СоздатьДокумент();
	ДокументПереоценка.Дата = ТекущаяДата();
	//ДокументПереоценка.ТипЦен = ТипЦен;
	
	// Заполняем табличную часть Товары
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ДокументПереоценка.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		
		// Генерируем случайную цену в диапазоне
		Диапазон = МаксимальнаяЦена - МинимальнаяЦена;
		Генератор = Новый ГенераторСлучайныхЧисел();
		СлучайноеЧисло = МинимальнаяЦена + (Диапазон * Генератор.СлучайноеЧисло(МинимальнаяЦена, МаксимальнаяЦена));
		НоваяСтрока.Цена = Окр(СлучайноеЧисло, 2);
		
	КонецЦикла;
	
	// Записываем и проводим документ
	Попытка
		ДокументПереоценка.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ДокументПереоценка.Ссылка;
	Исключение
		Сообщить("Ошибка при проведении документа: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Асинх Процедура ЗаполнитьШтрихкодыКоманда(Команда)
	
	Если НЕ Ждать ВопросАсинх("Заполнить случайными штрихкодами всю номенклатуру?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Результат = Ждать ЗаполнитьШтрихкодыНаСервере();
	Ждать ПредупреждениеАсинх(Результат);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьШтрихкодыНаСервере()
	
	// Запрос для получения всех номенклатур без штрихкодов и с штрихкодами
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	НЕ Номенклатура.ПометкаУдаления
	|	И НЕ Номенклатура.ЭтоГруппа";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "В системе нет номенклатуры.";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	КоличествоОбработано = 0;
	Генератор = Новый ГенераторСлучайныхЧисел();
	
	Пока Выборка.Следующий() Цикл
		
		Номенклатура = Выборка.Номенклатура;
		
		// Генерируем уникальный штрихкод
		Штрихкод = СгенерироватьУникальныйШтрихкод(Генератор);
		
		// Удаляем старые штрихкоды для этой номенклатуры
		МенеджерЗаписи = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Удалить();
		
		// Записываем новый штрихкод
		МенеджерЗаписи = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Штрихкод = Штрихкод;
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Записать();
		
		КоличествоОбработано = КоличествоОбработано + 1;
		
	КонецЦикла;
	
	Возврат СтрШаблон("Штрихкоды успешно заполнены. Обработано номенклатуры: %1", КоличествоОбработано);
	
КонецФункции

&НаСервере
Функция СгенерироватьУникальныйШтрихкод(Генератор)
	
	ПопыткиМаксимум = 100;
	ПопыткиСчётчик = 0;
	
	Пока ПопыткиСчётчик < ПопыткиМаксимум Цикл
		
		ПопыткиСчётчик = ПопыткиСчётчик + 1;
		
		// Генерируем 12 случайных цифр
		Штрихкод = "";
		Для Индекс = 1 По 12 Цикл
			Штрихкод = Штрихкод + Строка(Генератор.СлучайноеЧисло(0, 9));
		КонецЦикла;
		
		// Проверяем уникальность
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	1 КАК Поле
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Штрихкод = &Штрихкод";
		Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
		
		Если Запрос.Выполнить().Пустой() Тогда
			Возврат Штрихкод;
		КонецЕсли;
		
	КонецЦикла;
	
	// Если не удалось создать уникальный за 100 попыток, возвращаем с UUID
	Возврат СтрЗаменить(СтрЗаменить(Новый УникальныйИдентификатор(), "-", ""), " ", "");
	
КонецФункции
